; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 487999 1 3 4 4 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph0 - mode
	infrared1 - mode
	image2 - mode
	thermograph3 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 infrared1)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image2)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
)
(:goal (and
	(have_image Phenomenon4 thermograph0)
	(have_image Planet5 thermograph3)
	(have_image Phenomenon6 thermograph3)
	(have_image Star7 thermograph3)
	(have_image Phenomenon8 thermograph3)
	(have_image Phenomenon9 image2)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 6
3. (turn_to satellite0 star7 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star7)
   goals met: 0 of 6
4. (turn_to satellite0 phenomenon9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon9)
   goals met: 0 of 6
5. (take_image satellite0 phenomenon9 instrument1 image2)
   added: (have_image phenomenon9 image2)
   goals met: 1 of 6
6. (turn_to satellite0 star7 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star7)
   goals met: 1 of 6
7. (turn_to satellite0 phenomenon4 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon4)
   goals met: 1 of 6
8. (take_image satellite0 phenomenon4 instrument1 thermograph0)
   added: (have_image phenomenon4 thermograph0)
   goals met: 2 of 6
9. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 6
10. (turn_to satellite0 star7 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 star7)
   goals met: 2 of 6
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 6
12. (turn_to satellite0 groundstation3 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation3)
   goals met: 2 of 6
13. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 2 of 6
14. (turn_to satellite0 star7 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star7)
   goals met: 2 of 6
15. (take_image satellite0 star7 instrument0 thermograph3)
   added: (have_image star7 thermograph3)
   goals met: 3 of 6
16. (turn_to satellite0 planet5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet5)
   goals met: 3 of 6
17. (take_image satellite0 planet5 instrument0 thermograph3)
   added: (have_image planet5 thermograph3)
   goals met: 4 of 6
18. (turn_to satellite0 phenomenon8 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 6
19. (take_image satellite0 phenomenon8 instrument0 thermograph3)
   added: (have_image phenomenon8 thermograph3)
   goals met: 5 of 6
20. (turn_to satellite0 phenomenon6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon6)
   goals met: 5 of 6
21. (take_image satellite0 phenomenon6 instrument0 thermograph3)
   added: (have_image phenomenon6 thermograph3)
   goals met: 6 of 6
